# Consultas básicas SQL

<div style="border-left: 5px solid #f0ad4e; padding:1.25rem; border-right: 1px solid #eee;  border-top: 1px solid #eee;  border-bottom: 1px solid #eee;">

<h5 id="ensure-correct-role-and-provide-a-label">Nota Aclaratoria</h5>

<p>En <b>Jupyter Notebook</b> tendremos que habilitar la <b>extensión SQL</b> con las siguientes lineas.</p>

</div>

In [2]:
%load_ext sql
%sql sqlite://

# Paso 1 : Crear tabla
Aquí tienes un ejemplo de cómo se podría crear una tabla en SQL con 10 productos de abarrotes y las columnas correspondientes a la cantidad de productos, el precio y el pasillo en el que se encuentran:

In [3]:
%%sql
CREATE TABLE groceries (
  id INTEGER PRIMARY KEY,
  product_name TEXT,
  quantity INTEGER,
  price REAL,
  aisle INTEGER
);

INSERT INTO groceries (product_name, quantity, price, aisle)
VALUES
  ('Tomatoes', 5, 0.99, 3),
  ('Apples', 3, 1.49, 1),
  ('Bananas', 6, 0.79, 1),
  ('Carrots', 2, 0.59, 3),
  ('Onions', 1, 0.49, 3),
  ('Lettuce', 1, 0.99, 2),
  ('Potatoes', 5, 0.99, 3),
  ('Bread', 1, 2.49, 4),
  ('Milk', 1, 3.49, 5),
  ('Eggs', 12, 2.99, 5);

 * sqlite://
Done.
10 rows affected.

[]

# Paso 2: Consulta básica.

Haremos una consulta en la base de datos que nos muestre todos los elementos de groceries.

In [4]:
%%sql
SELECT * FROM groceries;

 * sqlite://
Done.

[(1, 'Tomatoes', 5, 0.99, 3),
 (2, 'Apples', 3, 1.49, 1),
 (3, 'Bananas', 6, 0.79, 1),
 (4, 'Carrots', 2, 0.59, 3),
 (5, 'Onions', 1, 0.49, 3),
 (6, 'Lettuce', 1, 0.99, 2),
 (7, 'Potatoes', 5, 0.99, 3),
 (8, 'Bread', 1, 2.49, 4),
 (9, 'Milk', 1, 3.49, 5),
 (10, 'Eggs', 12, 2.99, 5)]

# Paso 3: Seleccionar Columnas

Si quieres seleccionar columnas especificas a mostrar puedes señalar en el **select**, el nombre de las columnas.

In [5]:
%%sql
SELECT product_name FROM groceries;

 * sqlite://
Done.

[('Tomatoes',),
 ('Apples',),
 ('Bananas',),
 ('Carrots',),
 ('Onions',),
 ('Lettuce',),
 ('Potatoes',),
 ('Bread',),
 ('Milk',),
 ('Eggs',)]

# Paso 4: Consultas condicionales.
    
A continuación veremos una consulta donde buscaremos los abarrotes en el pasillo 2 y superiores

In [10]:
%%sql
SELECT * FROM groceries WHERE aisle >= 2;

 * sqlite://
Done.

[(1, 'Tomatoes', 5, 0.99, 3),
 (4, 'Carrots', 2, 0.59, 3),
 (5, 'Onions', 1, 0.49, 3),
 (6, 'Lettuce', 1, 0.99, 2),
 (7, 'Potatoes', 5, 0.99, 3),
 (8, 'Bread', 1, 2.49, 4),
 (9, 'Milk', 1, 3.49, 5),
 (10, 'Eggs', 12, 2.99, 5)]

# Paso 5: Ordenar las consultas por pasillo.

Ordenar las consultas por pasillo, desde el 1.

In [12]:
%%sql
SELECT * FROM groceries WHERE aisle > 1 ORDER BY aisle;

 * sqlite://
Done.

[(6, 'Lettuce', 1, 0.99, 2),
 (1, 'Tomatoes', 5, 0.99, 3),
 (4, 'Carrots', 2, 0.59, 3),
 (5, 'Onions', 1, 0.49, 3),
 (7, 'Potatoes', 5, 0.99, 3),
 (8, 'Bread', 1, 2.49, 4),
 (9, 'Milk', 1, 3.49, 5),
 (10, 'Eggs', 12, 2.99, 5)]

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">

Aquí tienes tres ejercicios básicos de consulta que se pueden realizar utilizando la tabla groceries que hemos creado anteriormente:

### Actividad del módulo #1

Escriba una consulta que muestre todos los productos y su precio.
Solución:

### Actividad del módulo #2

Escriba una consulta que muestre el nombre de todos los productos y su cantidad, ordenados por cantidad en orden descendente.

<blockquote>En la linea del <b>Order by</b> agregre <b>DESC</b>, si lo requiere consulte en internet para saber como hacerlo si lo requiere. </blockquote>
Solución:

### Actividad del módulo #3 

Escriba una consulta que muestre el nombre de todos los productos y su cantidad, pero solo para aquellos que tienen un precio mayor a $1.
Solución:

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">